# Sakila Star Schema & ETL
- Sakila is a sample database created by `MySQL` [link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version is `Pagila`[link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'reilly's public dimensional modelling tutorial schema

# Using ipython-sql
- load ipython-sql: `%load_ext sql`
- to execute SQL queries you write one of the following atop of your cell:
    - `%sql`:
        - for a one-liner SQL query
        - You can access a python var using `$`
    - `%%sql`:
        - for a multi-line SQL query
        - you can **NOT** access a python var using `$`
- Running a connection string like: `postgresql://postgres:postgres@db:5432/pagila` connect the database

# STEP1: Connect to the local database where Pagila is loaded

In [2]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

 set_config
------------

(1 row)

psql:Data/pagila-schema.sql:29: ERROR:  type "mpaa_rating" already exists
psql:Data/pagila-schema.sql:32: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:39: ERROR:  type "year" already exists
psql:Data/pagila-schema.sql:42: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:56: ERROR:  function "_group_concat" already exists with same argument types
psql:Data/pagila-schema.sql:59: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:73: ERROR:  function "film_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:76: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:90: ERROR:  function "film_not_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:93: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:135: ERROR:  function "get_customer_balance" already exists with same argument types
psql:Data/pagila-schema.sql:138: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:157: ERROR:  function "inventory_held_by_customer" already exists with same argument types
psql:Data/pagila-schema.sql:160: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:194: ERROR:  function "inventory_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:197: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:212: ERROR:  function "last_day" already exists with same argument types
psql:Data/pagila-schema.sql:215: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:227: ERROR:  function "last_updated" already exists with same argument types
psql:Data/pagila-schema.sql:230: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:241: ERROR:  relation "customer_customer_id_seq" already exists
psql:Data/pagila-schema.sql:244: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:265: ERROR:  relation "customer" already exists
psql:Data/pagila-schema.sql:268: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:329: ERROR:  function "rewards_report" already exists with same argument types
psql:Data/pagila-schema.sql:332: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:341: ERROR:  function "group_concat" already exists with same argument types
psql:Data/pagila-schema.sql:344: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:355: ERROR:  relation "actor_actor_id_seq" already exists
psql:Data/pagila-schema.sql:358: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:369: ERROR:  relation "actor" already exists
psql:Data/pagila-schema.sql:372: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:383: ERROR:  relation "category_category_id_seq" already exists
psql:Data/pagila-schema.sql:386: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:396: ERROR:  relation "category" already exists
psql:Data/pagila-schema.sql:399: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:410: ERROR:  relation "film_film_id_seq" already exists
psql:Data/pagila-schema.sql:413: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:434: ERROR:  relation "film" already exists
psql:Data/pagila-schema.sql:437: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:447: ERROR:  relation "film_actor" already exists
psql:Data/pagila-schema.sql:450: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:460: ERROR:  relation "film_category" already exists
psql:Data/pagila-schema.sql:463: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:483: ERROR:  relation "actor_info" already exists
psql:Data/pagila-schema.sql:486: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:497: ERROR:  relation "address_address_id_seq" already exists
psql:Data/pagila-schema.sql:500: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:515: ERROR:  relation "address" already exists
psql:Data/pagila-schema.sql:518: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:529: ERROR:  relation "city_city_id_seq" already exists
psql:Data/pagila-schema.sql:532: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:543: ERROR:  relation "city" already exists
psql:Data/pagila-schema.sql:546: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:557: ERROR:  relation "country_country_id_seq" already exists
psql:Data/pagila-schema.sql:560: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:570: ERROR:  relation "country" already exists
psql:Data/pagila-schema.sql:573: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:595: ERROR:  relation "customer_list" already exists
psql:Data/pagila-schema.sql:598: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:618: ERROR:  relation "film_list" already exists
psql:Data/pagila-schema.sql:621: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:632: ERROR:  relation "inventory_inventory_id_seq" already exists
psql:Data/pagila-schema.sql:635: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:646: ERROR:  relation "inventory" already exists
psql:Data/pagila-schema.sql:649: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:660: ERROR:  relation "language_language_id_seq" already exists
psql:Data/pagila-schema.sql:663: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:673: ERROR:  relation "language" already exists
psql:Data/pagila-schema.sql:676: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:696: ERROR:  relation "nicer_but_slower_film_list" already exists
psql:Data/pagila-schema.sql:699: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:710: ERROR:  relation "payment_payment_id_seq" already exists
psql:Data/pagila-schema.sql:713: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:727: ERROR:  relation "payment" already exists
psql:Data/pagila-schema.sql:730: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:743: ERROR:  relation "payment_p2020_01" already exists
psql:Data/pagila-schema.sql:744: ERROR:  "payment_p2020_01" is already a partition
psql:Data/pagila-schema.sql:747: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:760: ERROR:  relation "payment_p2020_02" already exists
psql:Data/pagila-schema.sql:761: ERROR:  "payment_p2020_02" is already a partition
psql:Data/pagila-schema.sql:764: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:777: ERROR:  relation "payment_p2020_03" already exists
psql:Data/pagila-schema.sql:778: ERROR:  "payment_p2020_03" is already a partition
psql:Data/pagila-schema.sql:781: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:794: ERROR:  relation "payment_p2020_04" already exists
psql:Data/pagila-schema.sql:795: ERROR:  "payment_p2020_04" is already a partition
psql:Data/pagila-schema.sql:798: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:811: ERROR:  relation "payment_p2020_05" already exists
psql:Data/pagila-schema.sql:812: ERROR:  "payment_p2020_05" is already a partition
psql:Data/pagila-schema.sql:815: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:828: ERROR:  relation "payment_p2020_06" already exists
psql:Data/pagila-schema.sql:829: ERROR:  "payment_p2020_06" is already a partition
psql:Data/pagila-schema.sql:832: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:843: ERROR:  relation "rental_rental_id_seq" already exists
psql:Data/pagila-schema.sql:846: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:860: ERROR:  relation "rental" already exists
psql:Data/pagila-schema.sql:863: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:879: ERROR:  relation "sales_by_film_category" already exists
psql:Data/pagila-schema.sql:882: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:893: ERROR:  relation "staff_staff_id_seq" already exists
psql:Data/pagila-schema.sql:896: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:914: ERROR:  relation "staff" already exists
psql:Data/pagila-schema.sql:917: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:928: ERROR:  relation "store_store_id_seq" already exists
psql:Data/pagila-schema.sql:931: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:942: ERROR:  relation "store" already exists
psql:Data/pagila-schema.sql:945: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:964: ERROR:  relation "sales_by_store" already exists
psql:Data/pagila-schema.sql:967: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:985: ERROR:  relation "staff_list" already exists
psql:Data/pagila-schema.sql:988: ERROR:  must be member of role "postgres"
psql:Data/pagila-schema.sql:995: ERROR:  multiple primary keys for table "actor" are not allowed
psql:Data/pagila-schema.sql:1003: ERROR:  multiple primary keys for table "address" are not allowed
psql:Data/pagila-schema.sql:1011: ERROR:  multiple primary keys for table "category" are not allowed
psql:Data/pagila-schema.sql:1019: ERROR:  multiple primary keys for table "city" are not allowed
psql:Data/pagila-schema.sql:1027: ERROR:  multiple primary keys for table "country" are not allowed

psql:Data/pagila-schema.sql:1035: ERROR:  multiple primary keys for table "customer" are not allowed
psql:Data/pagila-schema.sql:1043: ERROR:  multiple primary keys for table "film_actor" are not allowed
psql:Data/pagila-schema.sql:1051: ERROR:  multiple primary keys for table "film_category" are not allowed
psql:Data/pagila-schema.sql:1059: ERROR:  multiple primary keys for table "film" are not allowed
psql:Data/pagila-schema.sql:1067: ERROR:  multiple primary keys for table "inventory" are not allowed
psql:Data/pagila-schema.sql:1075: ERROR:  multiple primary keys for table "language" are not allowed
psql:Data/pagila-schema.sql:1083: ERROR:  multiple primary keys for table "rental" are not allowed
psql:Data/pagila-schema.sql:1091: ERROR:  multiple primary keys for table "staff" are not allowed
psql:Data/pagila-schema.sql:1099: ERROR:  multiple primary keys for table "store" are not allowed
psql:Data/pagila-schema.sql:1106: ERROR:  relation "film_fulltext_idx" already exists
psql:Data/pagila-schema.sql:1113: ERROR:  relation "idx_actor_last_name" already exists
psql:Data/pagila-schema.sql:1120: ERROR:  relation "idx_fk_address_id" already exists
psql:Data/pagila-schema.sql:1127: ERROR:  relation "idx_fk_city_id" already exists
psql:Data/pagila-schema.sql:1134: ERROR:  relation "idx_fk_country_id" already exists
psql:Data/pagila-schema.sql:1141: ERROR:  relation "idx_fk_customer_id" already exists
psql:Data/pagila-schema.sql:1148: ERROR:  relation "idx_fk_film_id" already exists
psql:Data/pagila-schema.sql:1155: ERROR:  relation "idx_fk_inventory_id" already exists
psql:Data/pagila-schema.sql:1162: ERROR:  relation "idx_fk_language_id" already exists
psql:Data/pagila-schema.sql:1169: ERROR:  relation "idx_fk_original_language_id" already exists
psql:Data/pagila-schema.sql:1176: ERROR:  relation "idx_fk_payment_p2020_01_customer_id" already exists
psql:Data/pagila-schema.sql:1183: ERROR:  relation "idx_fk_staff_id" already exists
psql:Data/pagila-schema.sql:1190: ERROR:  relation "idx_fk_payment_p2020_01_staff_id" already exists
psql:Data/pagila-schema.sql:1197: ERROR:  relation "idx_fk_payment_p2020_02_customer_id" already exists
psql:Data/pagila-schema.sql:1204: ERROR:  relation "idx_fk_payment_p2020_02_staff_id" already exists
psql:Data/pagila-schema.sql:1211: ERROR:  relation "idx_fk_payment_p2020_03_customer_id" already exists
psql:Data/pagila-schema.sql:1218: ERROR:  relation "idx_fk_payment_p2020_03_staff_id" already exists
psql:Data/pagila-schema.sql:1225: ERROR:  relation "idx_fk_payment_p2020_04_customer_id" already exists
psql:Data/pagila-schema.sql:1232: ERROR:  relation "idx_fk_payment_p2020_04_staff_id" already exists
psql:Data/pagila-schema.sql:1239: ERROR:  relation "idx_fk_payment_p2020_05_customer_id" already exists
psql:Data/pagila-schema.sql:1246: ERROR:  relation "idx_fk_payment_p2020_05_staff_id" already exists
psql:Data/pagila-schema.sql:1253: ERROR:  relation "idx_fk_payment_p2020_06_customer_id" already exists
psql:Data/pagila-schema.sql:1260: ERROR:  relation "idx_fk_payment_p2020_06_staff_id" already exists
psql:Data/pagila-schema.sql:1267: ERROR:  relation "idx_fk_store_id" already exists
psql:Data/pagila-schema.sql:1274: ERROR:  relation "idx_last_name" already exists
psql:Data/pagila-schema.sql:1281: ERROR:  relation "idx_store_id_film_id" already exists
psql:Data/pagila-schema.sql:1288: ERROR:  relation "idx_title" already exists
psql:Data/pagila-schema.sql:1295: ERROR:  relation "idx_unq_manager_staff_id" already exists
psql:Data/pagila-schema.sql:1302: ERROR:  relation "idx_unq_rental_rental_date_inventory_id_customer_id" already exists
psql:Data/pagila-schema.sql:1309: ERROR:  relation "payment_p2020_01_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1316: ERROR:  relation "payment_p2020_02_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1323: ERROR:  relation "payment_p2020_03_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1330: ERROR:  relation "payment_p2020_04_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1337: ERROR:  relation "payment_p2020_05_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1344: ERROR:  relation "payment_p2020_06_customer_id_idx" already exists
psql:Data/pagila-schema.sql:1435: ERROR:  trigger "film_fulltext_trigger" for relation "film" already exists
psql:Data/pagila-schema.sql:1442: ERROR:  trigger "last_updated" for relation "actor" already exists
psql:Data/pagila-schema.sql:1449: ERROR:  trigger "last_updated" for relation "address" already exists
psql:Data/pagila-schema.sql:1456: ERROR:  trigger "last_updated" for relation "category" already exists
psql:Data/pagila-schema.sql:1463: ERROR:  trigger "last_updated" for relation "city" already exists
psql:Data/pagila-schema.sql:1470: ERROR:  trigger "last_updated" for relation "country" already exists
psql:Data/pagila-schema.sql:1477: ERROR:  trigger "last_updated" for relation "customer" already exists
psql:Data/pagila-schema.sql:1484: ERROR:  trigger "last_updated" for relation "film" already exists
psql:Data/pagila-schema.sql:1491: ERROR:  trigger "last_updated" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1498: ERROR:  trigger "last_updated" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1505: ERROR:  trigger "last_updated" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1512: ERROR:  trigger "last_updated" for relation "language" already exists
psql:Data/pagila-schema.sql:1519: ERROR:  trigger "last_updated" for relation "rental" already exists
psql:Data/pagila-schema.sql:1526: ERROR:  trigger "last_updated" for relation "staff" already exists
psql:Data/pagila-schema.sql:1533: ERROR:  trigger "last_updated" for relation "store" already exists
psql:Data/pagila-schema.sql:1541: ERROR:  constraint "address_city_id_fkey" for relation "address" already exists
psql:Data/pagila-schema.sql:1549: ERROR:  constraint "city_country_id_fkey" for relation "city" already exists
psql:Data/pagila-schema.sql:1557: ERROR:  constraint "customer_address_id_fkey" for relation "customer" already exists
psql:Data/pagila-schema.sql:1565: ERROR:  constraint "customer_store_id_fkey" for relation "customer" already exists
psql:Data/pagila-schema.sql:1573: ERROR:  constraint "film_actor_actor_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1581: ERROR:  constraint "film_actor_film_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1589: ERROR:  constraint "film_category_category_id_fkey" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1597: ERROR:  constraint "film_category_film_id_fkey" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1605: ERROR:  constraint "film_language_id_fkey" for relation "film" already exists
psql:Data/pagila-schema.sql:1613: ERROR:  constraint "film_original_language_id_fkey" for relation "film" already exists
psql:Data/pagila-schema.sql:1621: ERROR:  constraint "inventory_film_id_fkey" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1629: ERROR:  constraint "inventory_store_id_fkey" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1637: ERROR:  constraint "payment_p2020_01_customer_id_fkey" for relation "payment_p2020_01" already exists
psql:Data/pagila-schema.sql:1645: ERROR:  constraint "payment_p2020_01_rental_id_fkey" for relation "payment_p2020_01" already exists
psql:Data/pagila-schema.sql:1653: ERROR:  constraint "payment_p2020_01_staff_id_fkey" for relation "payment_p2020_01" already exists
psql:Data/pagila-schema.sql:1661: ERROR:  constraint "payment_p2020_02_customer_id_fkey" for relation "payment_p2020_02" already exists
psql:Data/pagila-schema.sql:1669: ERROR:  constraint "payment_p2020_02_rental_id_fkey" for relation "payment_p2020_02" already exists
psql:Data/pagila-schema.sql:1677: ERROR:  constraint "payment_p2020_02_staff_id_fkey" for relation "payment_p2020_02" already exists
psql:Data/pagila-schema.sql:1685: ERROR:  constraint "payment_p2020_03_customer_id_fkey" for relation "payment_p2020_03" already exists
psql:Data/pagila-schema.sql:1693: ERROR:  constraint "payment_p2020_03_rental_id_fkey" for relation "payment_p2020_03" already exists
psql:Data/pagila-schema.sql:1701: ERROR:  constraint "payment_p2020_03_staff_id_fkey" for relation "payment_p2020_03" already exists
psql:Data/pagila-schema.sql:1709: ERROR:  constraint "payment_p2020_04_customer_id_fkey" for relation "payment_p2020_04" already exists
psql:Data/pagila-schema.sql:1717: ERROR:  constraint "payment_p2020_04_rental_id_fkey" for relation "payment_p2020_04" already exists
psql:Data/pagila-schema.sql:1725: ERROR:  constraint "payment_p2020_04_staff_id_fkey" for relation "payment_p2020_04" already exists
psql:Data/pagila-schema.sql:1733: ERROR:  constraint "payment_p2020_05_customer_id_fkey" for relation "payment_p2020_05" already exists
psql:Data/pagila-schema.sql:1741: ERROR:  constraint "payment_p2020_05_rental_id_fkey" for relation "payment_p2020_05" already exists
psql:Data/pagila-schema.sql:1749: ERROR:  constraint "payment_p2020_05_staff_id_fkey" for relation "payment_p2020_05" already exists
psql:Data/pagila-schema.sql:1757: ERROR:  constraint "payment_p2020_06_customer_id_fkey" for relation "payment_p2020_06" already exists
psql:Data/pagila-schema.sql:1765: ERROR:  constraint "payment_p2020_06_rental_id_fkey" for relation "payment_p2020_06" already exists
psql:Data/pagila-schema.sql:1773: ERROR:  constraint "payment_p2020_06_staff_id_fkey" for relation "payment_p2020_06" already exists
psql:Data/pagila-schema.sql:1781: ERROR:  constraint "rental_customer_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1789: ERROR:  constraint "rental_inventory_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1797: ERROR:  constraint "rental_staff_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1805: ERROR:  constraint "staff_address_id_fkey" for relation "staff" already exists
psql:Data/pagila-schema.sql:1813: ERROR:  constraint "staff_store_id_fkey" for relation "staff" already exists
psql:Data/pagila-schema.sql:1821: ERROR:  constraint "store_address_id_fkey" for relation "store" already exists

 set_config
------------

(1 row)

psql:Data/pagila-data.sql:224: ERROR:  duplicate key value violates unique constraint "actor_pkey"
DETAIL:  Key (actor_id)=(1) already exists.
CONTEXT:  COPY actor, line 1
psql:Data/pagila-data.sql:341: ERROR:  duplicate key value violates unique constraint "country_pkey"
DETAIL:  Key (country_id)=(1) already exists.
CONTEXT:  COPY country, line 1
psql:Data/pagila-data.sql:949: ERROR:  duplicate key value violates unique constraint "city_pkey"
DETAIL:  Key (city_id)=(1) already exists.
CONTEXT:  COPY city, line 1
psql:Data/pagila-data.sql:1560: ERROR:  duplicate key value violates unique constraint "address_pkey"
DETAIL:  Key (address_id)=(1) already exists.
CONTEXT:  COPY address, line 1
psql:Data/pagila-data.sql:1584: ERROR:  duplicate key value violates unique constraint "category_pkey"
DETAIL:  Key (category_id)=(1) already exists.
CONTEXT:  COPY category, line 1
psql:Data/pagila-data.sql:1594: ERROR:  duplicate key value violates unique constraint "store_pkey"
DETAIL:  Key (store_id)=(1) already exists.
CONTEXT:  COPY store, line 1
psql:Data/pagila-data.sql:2201: ERROR:  duplicate key value violates unique constraint "customer_pkey"
DETAIL:  Key (customer_id)=(1) already exists.
CONTEXT:  COPY customer, line 1
psql:Data/pagila-data.sql:2215: ERROR:  duplicate key value violates unique constraint "language_pkey"
DETAIL:  Key (language_id)=(1) already exists.
CONTEXT:  COPY language, line 1
psql:Data/pagila-data.sql:3223: ERROR:  duplicate key value violates unique constraint "film_pkey"
DETAIL:  Key (film_id)=(1) already exists.
CONTEXT:  COPY film, line 1: "1	ACADEMY DINOSAUR	A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The C..."
psql:Data/pagila-data.sql:8693: ERROR:  duplicate key value violates unique constraint "film_actor_pkey"
DETAIL:  Key (actor_id, film_id)=(1, 1) already exists.
CONTEXT:  COPY film_actor, line 1
psql:Data/pagila-data.sql:9701: ERROR:  duplicate key value violates unique constraint "film_category_pkey"
DETAIL:  Key (film_id, category_id)=(1, 6) already exists.
CONTEXT:  COPY film_category, line 1
psql:Data/pagila-data.sql:14290: ERROR:  duplicate key value violates unique constraint "inventory_pkey"
DETAIL:  Key (inventory_id)=(1) already exists.
CONTEXT:  COPY inventory, line 1
psql:Data/pagila-data.sql:14300: ERROR:  duplicate key value violates unique constraint "staff_pkey"
DETAIL:  Key (staff_id)=(1) already exists.
CONTEXT:  COPY staff, line 1
psql:Data/pagila-data.sql:30352: ERROR:  duplicate key value violates unique constraint "rental_pkey"
DETAIL:  Key (rental_id)=(2) already exists.
CONTEXT:  COPY rental, line 1
 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [4]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Requirement already satisfied: six in ./opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: setuptools>=18.5 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (51.1.2)
Requirement already satisfied: pygments in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: traitlets>=4.2 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: decorator in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: pexpect>4.3 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: appnope in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: jedi>=0.10 in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: backcall in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in ./opt/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in ./opt/anaconda3/lib/python3.8/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: ptyprocess>=0.5 in ./opt/anaconda3/lib/python3.8/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.6.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: wcwidth in ./opt/anaconda3/lib/python3.8/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Collecting sqlparse
  Downloading sqlparse-0.4.1-py3-none-any.whl (42 kB)
     |████████████████████████████████| 42 kB 1.0 MB/s eta 0:00:01
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py) ... done
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13700 sha256=f6df899302066d3f976d527337e829e310b70c01e40d2ded93515291c174a947
  Stored in directory: /Users/alexdinh/Library/Caches/pip/wheels/48/6d/77/9517cb933af254f51a446f1a5ec9c2be3e45f17384940bce68
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1
WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the '/Users/alexdinh/opt/anaconda3/bin/python -m pip install --upgrade pip' command.

In [6]:
!/Users/alexdinh/opt/anaconda3/bin/python -m pip install --upgrade pip

Requirement already satisfied: pip in ./opt/anaconda3/lib/python3.8/site-packages (20.3.3)
Collecting pip
  Downloading pip-21.0.1-py3-none-any.whl (1.5 MB)
     |████████████████████████████████| 1.5 MB 2.5 MB/s eta 0:00:01
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 20.3.3
    Uninstalling pip-20.3.3:
      Successfully uninstalled pip-20.3.3
Successfully installed pip-21.0.1

In [7]:
%load_ext sql

## Now we reach to connect newly created db

In [10]:
DB_ENDPOINT= "127.0.0.1" #destination address aka local host
DB= 'pagila' #Destination database
DB_USER ='student'
DB_PASSWORD='student'
DB_PORT ='5432'

# create a connection string
# postgresql://username:password@host:port/database
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER,DB_PASSWORD,DB_ENDPOINT,DB_PORT,DB)
print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [11]:
%sql $conn_string

# STEP 2: Explore the 3NF Schema /third normalized form

## 2.1 How much? What data sizes are we looking at?

In [12]:
nStores=%sql select count(*) from store;
nFilms=%sql select count(*) from film;
nCustomers=%sql select count(*) from customer;
nRentals=%sql select count(*) from rental;
nPayment=%sql select count(*) from payment;
nStaff=%sql select count(*) from staff;
nCity=%sql select count(*) from city;
nCountry=%sql select count(*) from country;

#display the tables 
print("nFilms\t\t=",nFilms[0][0])
print("nCustomers\t\t=",nCustomers[0][0])
print("nRentals\t\t=",nRentals[0][0])
print("nPayment\t\t=",nPayment[0][0])
print("nStaff\t\t=",nStaff[0][0])
print("nStores\t\t=",nStores[0][0])
print("nCities\t\t=",nCity[0][0])
print("nCountry\t\t=",nCountry[0][0])

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers		= 599
nRentals		= 16044
nPayment		= 48147
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

## 2.2 When? What time period are we talking about?

In [14]:
%%sql
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2020, 1, 24, 23, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), datetime.datetime(2020, 5, 14, 15, 44, 29, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)))]

## 2.3 Where? Where do the event in this DB occur?
TO-DO: Write a query displays the num of adds by district in the adds table. Limit the table to the top 10 districts.

In [36]:
%%sql
select district,count(address) as n
from address
group by district
order by n desc,district
limit 10

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('California', 9),
 ('Shandong', 9),
 ('West Bengali', 9),
 ('So Paulo', 8),
 ('Uttar Pradesh', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

# STEP 3 Perform some simple data analysis

### 3NF - Entity Relationship Diagram
<img src="./pagila-3nf.png" width="80%"/>

## 3.1 Insight 1: TOP GROSSING MOVIES
- Payment amount are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` items and `inventory` item refer to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [38]:
%%sql
select film_id,title, release_year, rental_rate, rating from film limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

### 3.1.2 Payments

In [39]:
%%sql
select * from payment limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2020, 1, 24, 23, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2020, 1, 25, 17, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2020, 1, 28, 23, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2020, 1, 29, 2, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2020, 1, 29, 10, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)))]

### 3.1.3 Inventory

In [40]:
%%sql 
select * from inventory limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 12, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (2, 1, 1, datetime.datetime(2020, 2, 15, 12, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (3, 1, 1, datetime.datetime(2020, 2, 15, 12, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (4, 1, 1, datetime.datetime(2020, 2, 15, 12, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (5, 1, 2, datetime.datetime(2020, 2, 15, 12, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)))]

### 3.1.4 Get the movie of every payment

In [41]:
%%sql
SELECT f.title, p.amount, p.payment_date,p.customer_id
FROM payment p
JOIN rental r ON (p.rental_id=r.rental_id)
JOIN inventory i ON (r.inventory_id=i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2020, 1, 24, 23, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2020, 1, 25, 17, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2020, 1, 28, 23, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2020, 1, 29, 2, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2020, 1, 29, 10, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 269)]

### 3.1.5 Sum of movie rental revenue

In [46]:
%%sql
SELECT f.title, sum(p.amount) as revenue
from payment p
join rental r on (p.rental_id=r.rental_id)
join inventory i on (r.inventory_id=i.inventory_id)
join film f on (i.film_id=f.film_id)
group by f.title
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('695.19')),
 ('WIFE TURN', Decimal('671.07')),
 ('ZORRO ARK', Decimal('644.07')),
 ('GOODFELLAS SALUTE', Decimal('629.07')),
 ('SATURDAY LAMBS', Decimal('614.16')),
 ('TITANS JERK', Decimal('605.13')),
 ('TORQUE BOUND', Decimal('596.16')),
 ('HARRY IDAHO', Decimal('587.10')),
 ('INNOCENT USUAL', Decimal('575.22')),
 ('HUSTLER PARTY', Decimal('572.34'))]

## 3.2 Insight 2: Top grossing cities
- payment amount are in table `payment` 
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Get the city of each payment

In [47]:
%%sql
SELECT p.customer_id,p.rental_id,p.amount,ci.city
FROM payment p
JOIN customer c on (p.customer_id=c.customer_id)
JOIN address a on (c.address_id=c.address_id)
JOIN city ci on (a.city_id=ci.city_id)
order by p.payment_date
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'Jining'),
 (130, 1, Decimal('2.99'), 'Juiz de Fora'),
 (130, 1, Decimal('2.99'), 'Sullana'),
 (130, 1, Decimal('2.99'), 'Jinzhou'),
 (130, 1, Decimal('2.99'), 'Garden Grove'),
 (130, 1, Decimal('2.99'), 'Szkesfehrvr'),
 (130, 1, Decimal('2.99'), 'Tieli'),
 (130, 1, Decimal('2.99'), 'Lausanne'),
 (130, 1, Decimal('2.99'), 'Patras'),
 (130, 1, Decimal('2.99'), 'al-Manama')]

### 3.2.2 Top grossing cities

In [51]:
%%sql
select ci.city, sum(p.amount) as revenue
from payment p
join customer c on (p.customer_id=c.customer_id)
join address a on (c.address_id=a.address_id)
join city ci on (a.city_id=ci.city_id)
group by city
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('664.65')),
 ('Saint-Denis', Decimal('649.62')),
 ('Aurora', Decimal('595.50')),
 ('Molodetno', Decimal('586.74')),
 ('Santa Brbara dOeste', Decimal('583.83')),
 ('Apeldoorn', Decimal('583.83')),
 ('Qomsheh', Decimal('559.86')),
 ('London', Decimal('541.56')),
 ('Ourense (Orense)', Decimal('532.80')),
 ('Bijapur', Decimal('526.83'))]

## 3.3 Insight 3: Revenue of a movie by customer city and by month

### 3.3.1 Total revenue by month

In [52]:
%%sql 
select sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('84283.56'), 4.0),
 (Decimal('71659.68'), 3.0),
 (Decimal('28895.64'), 2.0),
 (Decimal('14473.29'), 1.0),
 (Decimal('2937.36'), 5.0)]

### 3.3.2 Each movie by customer city and by month

In [53]:
%%sql
select f.title,p.amount,p.customer_id,ci.city, p.payment_date, EXTRACT(month from p.payment_date) as month
from payment p 
join rental r on (p.rental_id=r.rental_id)
join inventory i on (r.inventory_id=i.inventory_id)
join film f on (i.film_id=f.film_id)
join customer c on (p.customer_id=c.customer_id)
join address a on (c.address_id=a.address_id)
join city ci on (a.city_id=ci.city_id)
order by p.payment_date
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 24, 23, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 24, 23, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 24, 23, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 24, 23, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 24, 23, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 24, 23, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 24, 23, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 24, 23, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 24, 23, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2020, 1, 24, 23, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 1.0)]

### 3.3.3 Sum of revenue of each movie by customer city and by month

In [58]:
%%sql
select f.title, ci.city, EXTRACT(month from payment_date) as month, sum(p.amount) as revenue
from payment p 
join rental r on (p.rental_id=r.rental_id)
join inventory i on (r.inventory_id=i.inventory_id)
join film f on (i.film_id=f.film_id)
join customer c on (p.customer_id=c.customer_id)
join address a on (c.address_id=a.address_id)
join city ci on (a.city_id=ci.city_id)
group by ci.city,f.title,p.payment_date,month
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('SCORPION APOLLO', 'Osmaniye', 4.0, Decimal('35.97')),
 ('MIDSUMMER GROUNDHOG', 'Szkesfehrvr', 4.0, Decimal('35.97')),
 ('MINE TITANS', 'Juiz de Fora', 4.0, Decimal('35.97')),
 ('TIES HUNGER', 'Naju', 3.0, Decimal('35.97')),
 ('FLINTSTONES HAPPINESS', 'Pemalang', 3.0, Decimal('35.97')),
 ('SCORPION APOLLO', 'Siegen', 3.0, Decimal('35.97')),
 ('VIRTUAL SPOILERS', 'Arlington', 2.0, Decimal('35.97')),
 ('STING PERSONAL', 'Belm', 3.0, Decimal('35.97')),
 ('SHOW LORD', 'Mannheim', 1.0, Decimal('35.97')),
 ('TRAP GUYS', 'Usak', 3.0, Decimal('35.97'))]

# STEP 4: